; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	image3 - mode
	thermograph5 - mode
	image4 - mode
	thermograph0 - mode
	thermograph1 - mode
	image2 - mode
	Star0 - direction
	Star2 - direction
	GroundStation6 - direction
	Star1 - direction
	GroundStation7 - direction
	GroundStation5 - direction
	Star4 - direction
	GroundStation3 - direction
	Star8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
)
(:init
	(supports instrument0 image2)
	(supports instrument0 thermograph5)
	(supports instrument0 image3)
	(calibration_target instrument0 GroundStation7)
	(calibration_target instrument0 Star1)
	(supports instrument1 image2)
	(supports instrument1 thermograph5)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 GroundStation5)
	(supports instrument2 image4)
	(supports instrument2 image3)
	(supports instrument2 thermograph5)
	(calibration_target instrument2 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation7)
	(supports instrument3 thermograph5)
	(supports instrument3 image4)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 GroundStation3)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation7)
	(supports instrument4 thermograph5)
	(supports instrument4 image4)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 Star4)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation7)
	(supports instrument5 image3)
	(supports instrument5 thermograph1)
	(calibration_target instrument5 GroundStation3)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation7)
)
(:goal (and
	(pointing satellite3 Star1)
	(have_image Star8 thermograph5)
	(have_image Star8 image2)
	(have_image Star9 thermograph1)
	(have_image Phenomenon10 thermograph1)
	(have_image Phenomenon10 image4)
	(have_image Phenomenon11 thermograph5)
	(have_image Phenomenon12 thermograph1)
	(have_image Phenomenon12 image2)
))

)

; plan
1. (turn_to satellite3 groundstation3 groundstation7)
   deleted: (pointing satellite3 groundstation7)
   added: (pointing satellite3 groundstation3)
   goals met: 0 of 9
2. (switch_on instrument5 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument5)
   goals met: 0 of 9
3. (calibrate satellite3 instrument5 groundstation3)
   added: (calibrated instrument5)
   goals met: 0 of 9
4. (turn_to satellite3 phenomenon12 groundstation3)
   deleted: (pointing satellite3 groundstation3)
   added: (pointing satellite3 phenomenon12)
   goals met: 0 of 9
5. (take_image satellite3 phenomenon12 instrument5 thermograph1)
   added: (have_image phenomenon12 thermograph1)
   goals met: 1 of 9
6. (turn_to satellite3 phenomenon10 phenomenon12)
   deleted: (pointing satellite3 phenomenon12)
   added: (pointing satellite3 phenomenon10)
   goals met: 1 of 9
7. (turn_to satellite1 groundstation3 groundstation7)
   deleted: (pointing satellite1 groundstation7)
   added: (pointing satellite1 groundstation3)
   goals met: 1 of 9
8. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 1 of 9
9. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 9
10. (calibrate satellite1 instrument3 groundstation3)
   added: (calibrated instrument3)
   goals met: 1 of 9
11. (calibrate satellite0 instrument0 groundstation7)
   added: (calibrated instrument0)
   goals met: 1 of 9
12. (take_image satellite3 phenomenon10 instrument5 thermograph1)
   added: (have_image phenomenon10 thermograph1)
   goals met: 2 of 9
13. (turn_to satellite0 phenomenon11 groundstation7)
   deleted: (pointing satellite0 groundstation7)
   added: (pointing satellite0 phenomenon11)
   goals met: 2 of 9
14. (take_image satellite0 phenomenon11 instrument0 thermograph5)
   added: (have_image phenomenon11 thermograph5)
   goals met: 3 of 9
15. (turn_to satellite0 phenomenon12 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 phenomenon12)
   goals met: 3 of 9
16. (take_image satellite0 phenomenon12 instrument0 image2)
   added: (have_image phenomenon12 image2)
   goals met: 4 of 9
17. (turn_to satellite0 star8 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 star8)
   goals met: 4 of 9
18. (take_image satellite0 star8 instrument0 image2)
   added: (have_image star8 image2)
   goals met: 5 of 9
19. (take_image satellite0 star8 instrument0 thermograph5)
   added: (have_image star8 thermograph5)
   goals met: 6 of 9
20. (turn_to satellite1 phenomenon10 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 phenomenon10)
   goals met: 6 of 9
21. (take_image satellite1 phenomenon10 instrument3 image4)
   added: (have_image phenomenon10 image4)
   goals met: 7 of 9
22. (turn_to satellite3 star9 phenomenon10)
   deleted: (pointing satellite3 phenomenon10)
   added: (pointing satellite3 star9)
   goals met: 7 of 9
23. (take_image satellite3 star9 instrument5 thermograph1)
   added: (have_image star9 thermograph1)
   goals met: 8 of 9
24. (turn_to satellite3 star1 star9)
   deleted: (pointing satellite3 star9)
   added: (pointing satellite3 star1)
   goals met: 9 of 9
